bench/m0-redux/results/2026-09-24/mtp-k7/chat-c1-qwen-thinkoff-s1.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x75c106b8efc0>, trust_remote_code=False, seed=1, num_prompts=80, dataset_name='hf', no_stream=False, dataset_path='philschmid/mt-bench', no_oversample=False, skip_chat_template=True, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=512, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='nvidia/Qwen3.8-27B-NVFP4', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=4, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['config=mtp-k7', 'cell=chat', 'sampling=qwen', 'thinking=off', 'max_model_len=262144', 'seed=1'], result_dir='/workspace/m0-redux/results/2026-09-24/mtp-k7', result_filename='chat-c1-qwen-thinkoff-s1.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-10f720de-', top_p=0.8, top_k=20, min_p=None, temperature=0.7, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body={'chat_template_kwargs': {'enable_thinking': False}}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 4 requests...
100%|██████████| 4/4 [00:11<00:00,  2.84s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 80/80 [03:30<00:00,  2.64s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     80        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  210.99    
Total input tokens:                      6452      
Total generated tokens:                  29747     
Request throughput (req/s):              0.38      
Output token throughput (tok/s):         140.99    
Peak output token throughput (tok/s):    41.00     
Peak concurrent requests:                3.00      
Total token throughput (tok/s):          171.57    
---------------Time to First Token----------------
Mean TTFT (ms):                          72.84     
Median TTFT (ms):                        66.11     
P50 TTFT (ms):                           66.11     
P90 TTFT (ms):                           118.98    
P99 TTFT (ms):                           123.92    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          6.81      
Median TPOT (ms):                        6.44      
P50 TPOT (ms):                           6.44      
P90 TPOT (ms):                           10.05     
P99 TPOT (ms):                           11.13     
---------------Inter-token Latency----------------
Mean ITL (ms):                           24.88     
Median ITL (ms):                         25.38     
P50 ITL (ms):                            25.38     
P90 ITL (ms):                            25.63     
P99 ITL (ms):                            25.87     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          2637.15   
Median E2EL (ms):                        2642.06   
P50 E2EL (ms):                           2642.06   
P90 E2EL (ms):                           4634.91   
P99 E2EL (ms):                           5442.49   
---------------Speculative Decoding---------------
Acceptance rate (%):                     38.38     
Acceptance length:                       3.69      
Drafts:                                  8095      
Draft tokens:                            56665     
Accepted tokens:                         21749     
Per-position acceptance (%):
  Position 0:                            79.57     
  Position 1:                            57.88     
  Position 2:                            41.69     
  Position 3:                            31.82     
  Position 4:                            24.16     
  Position 5:                            18.74     
  Position 6:                            14.81     
==================================================